# Qn 1

In [8]:
import pandas as pd
print(pd.__version__)

1.1.1

# Qn 2

In [13]:
import numpy as np
l=list(range(1,5))
a=np.arange(1,9,2)
d={'a':0,'b':1,'c':2}
s1=pd.Series(l,index=[100,101,102,103])
s2=pd.Series(a)
s3=pd.Series(d)
print(s1)
print(s2)
print(s3)

100    1
101    2
102    3
103    4
dtype: int64
0    1
1    3
2    5
3    7
dtype: int32
a    0
b    1
c    2
dtype: int64

# Qn 3

In [15]:
s1.to_frame()

     0
100  1
101  2
102  3
103  4

In [16]:
s1.reset_index()
s1

100    1
101    2
102    3
103    4
dtype: int64

# Qn 4

In [19]:
a_series=pd.Series(['abc','def','ghi'])
b_series=pd.Series([1,2,3,4,5])
df=pd.DataFrame()
df=pd.concat([a_series,b_series],axis=1)
df

     0  1
0  abc  1
1  def  2
2  ghi  3
3  NaN  4
4  NaN  5

# Qn 5

In [21]:
name=['Ann','Susan','Grace']
n=pd.Series(name,index=['s1','s2','s3'])
n.index.name='S No'
n

S No
s1      Ann
s2    Susan
s3    Grace
dtype: object

# Qn 6

In [22]:
srA=pd.Series([1,2,3,4,5,6])
srB=pd.Series([2,4,6,8])
res=srA[~srA.isin(srB)]
res

0    1
2    3
4    5
dtype: int64

# Qn 7

In [23]:
union=pd.Series(np.union1d(srA,srB))
intersect=pd.Series(np.intersect1d(srA,srB))
notcomm=union[~union.isin(intersect)]
notcomm

0    1
2    3
4    5
6    8
dtype: int64

# Qn 8

In [25]:
num=np.random.RandomState(100)
num_series=pd.Series(num.normal(10,4,20))
print(num_series)
result=np.percentile(num_series,q=[0,25,50,75,100])
print("Minimum, 25th percentile, median, 75th ,Maximum:")
print(result)

0      3.000938
1     11.370722
2     14.612143
3      8.990256
4     13.925283
5     12.056875
6     10.884719
7      5.719827
8      9.242017
9     11.020006
10     8.167892
11    11.740654
12     7.665620
13    13.267388
14    12.690883
15     9.582355
16     7.874878
17    14.118931
18     8.247458
19     5.526727
dtype: float64
Minimum, 25th percentile, median, 75th ,Maximum:
[ 3.00093811  8.09463867 10.23353705 12.21537733 14.61214321]

# Qn 9

In [26]:
city=pd.Series(['Kochi','Chennai','Kochi','Delhi','Mumbai','Kochi','Chennai'])
city.value_counts()

Kochi      3
Chennai    2
Delhi      1
Mumbai     1
dtype: int64

# Qn 10

In [32]:
city[~city.isin(city.value_counts().index[:2])]='Other'
city

0      Kochi
1    Chennai
2      Kochi
3      Other
4      Other
5      Kochi
6    Chennai
dtype: object

# Qn 11

In [33]:
pd.qcut(num_series,q=10)

0         (3.0, 5.701]
1      (11.16, 11.836]
2     (13.945, 14.612]
3       (8.224, 9.141]
4     (12.806, 13.945]
5     (11.836, 12.806]
6      (10.234, 11.16]
7       (5.701, 7.833]
8      (9.141, 10.234]
9      (10.234, 11.16]
10      (7.833, 8.224]
11     (11.16, 11.836]
12      (5.701, 7.833]
13    (12.806, 13.945]
14    (11.836, 12.806]
15     (9.141, 10.234]
16      (7.833, 8.224]
17    (13.945, 14.612]
18      (8.224, 9.141]
19        (3.0, 5.701]
dtype: category
Categories (10, interval[float64]): [(3.0, 5.701] < (5.701, 7.833] < (7.833, 8.224] < (8.224, 9.141] ... (11.16, 11.836] < (11.836, 12.806] < (12.806, 13.945] < (13.945, 14.612]]

# Qn12

In [35]:
matrix=pd.DataFrame(np.arange(1,10).reshape(3,3))
matrix

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# Qn 13

In [37]:
sr1=pd.Series(np.random.randint(1,10,10))
print(sr1)
sr1.where(lambda x:x%3==0).dropna()

0    6
1    2
2    7
3    4
4    2
5    9
6    4
7    6
8    1
9    9
dtype: int32

0    6.0
5    9.0
7    6.0
9    9.0
dtype: float64

# Qn 14

In [38]:
pos=[0,3,6,7]
sr1.loc[pos]

0    6
3    4
6    4
7    6
dtype: int32

# Qn 15

In [42]:
srA.append(srB)
print("horizontal:\n",pd.concat([srA,srB],axis=0))
print("vertical:\n",pd.concat([srA,srB],axis=1))

horizontal:
 0    1
1    2
2    3
3    4
4    5
5    6
0    2
1    4
2    6
3    8
dtype: int64
vertical:
    0    1
0  1  2.0
1  2  4.0
2  3  6.0
3  4  8.0
4  5  NaN
5  6  NaN

# Qn 16

In [43]:
ls=list(srA[srA.isin(srB)].index)
ls

[1, 3, 5]

# Qn 17